Repository: alpriest/EnergyStats
Catalog: Energy Stats/Localizable.xcstrings
Source language: en
Languages: de, es, it, pl

source: You appear to be offline. Please check your connection.
de: Sie scheinen offline zu sein. Bitte überprüfen Sie Ihre Internetverbindung.
es: Parece que estás desconectado. Por favor, verifica tu conexión.
it: Sembri essere offline. Controlla la tua connessione.
pl: Wydajesz się być offline. Proszę sprawdzić połączenie.

source: You can also find this video link in the Settings FAQ section
de: Diesen Videolink finden Sie auch im FAQ-Bereich der Einstellungen.
es: También puedes encontrar este enlace de video en la sección de preguntas frecuentes de Configuración.
it: Puoi trovare questo link al video anche nella sezione FAQ delle Impostazioni.
pl: Ten link do wideo znajdziesz również w sekcji FAQ w Ustawieniach.

source: You cannot undo this action
de: Diese Aktion kann nicht rückgängig gemacht werden
es: Esta acción no se puede deshacer
it: Questa azione non può essere annullata
pl: Nie można cofnąć tej operacji

source: You have exceeded your free daily limit of requests. Please try tomorrow.
de: Sie haben Ihr tägliches Freikontingent an Anfragen überschritten. Bitte versuchen Sie es morgen erneut.
es: Has superado tu límite diario de solicitudes gratuitas. Por favor, inténtalo de nuevo mañana.
it: Hai superato il limite giornaliero di richieste gratuite. Per favore riprova domani.
pl: Przekroczyłeś swój dzienny limit bezpłatnych zapytań. Spróbuj ponownie jutro.

source: You have no time periods defined. Add a time period to define how you'd like your inverter to behave during specific hours.
de: Sie haben keine Zeitperioden definiert. Fügen Sie eine Zeitperiode hinzu, um zu definieren, wie sich Ihr Wechselrichter zu bestimmten Stunden verhalten soll.
es: No tienes períodos de tiempo definidos. Añade un período de tiempo para definir cómo te gustaría que se comportara tu inversor durante horas específicas.
it: Non hai periodi di tempo definiti. Aggiungi un periodo di tempo per definire come desideri che il tuo inverter si comporti durante ore specifiche.
pl: Nie masz zdefiniowanych okresów czasu. Dodaj okres czasu, aby określić, jak chcesz, aby Twój falownik zachowywał się w określonych godzinach.

source: You've hit the server rate limit. Please try later.
de: Sie haben das Server-Limit erreicht. Bitte versuchen Sie es später erneut.
es: Ha alcanzado el límite de velocidad del servidor. Por favor, intente más tarde.
it: Hai raggiunto il limite di richieste al server. Riprova più tardi.
pl: Osiągnięto limit prędkości serwera. Proszę spróbować później.

source: Your API token is invalid. Please logout and follow the instructions to generate a new API token.
de: Dein API-Token ist ungültig. Bitte melde dich ab und folge den Anweisungen, um ein neues API-Token zu generieren.
es: Tu token de API no es válido. Por favor, cierra sesión y sigue las instrucciones para generar un nuevo token de API.
it: Il tuo token API non è valido. Effettua il logout e segui le istruzioni per generare un nuovo token API.
pl: Twój token API jest nieprawidłowy. Wyloguj się i postępuj zgodnie z instrukcjami, aby wygenerować nowy token API.

source: Your inverter doesn't store PV generation data so we can't show historic solar data.
de: Dein Wechselrichter speichert keine PV-Erzeugungsdaten, daher können wir keine historischen Solardaten anzeigen.
es: Tu inversor no almacena datos de generación fotovoltaica, así que no podemos mostrar datos solares históricos.
it: Il tuo inverter non memorizza i dati di generazione fotovoltaica, quindi non possiamo mostrare i dati storici del solare.
pl: Twój falownik nie zapisuje danych o produkcji energii z PV, więc nie możemy wyświetlić historycznych danych słonecznych.

source: Your inverter state is reported as being
de: Der Zustand Ihres Wechselrichters wird als
it: Lo stato del tuo inverter è segnalato come
pl: Stan Twojego inwertera jest zgłaszany jako

source: Your Solcast predictions are fetched when Energy Stats loads (at most once every 8 hours). Add the 'Solcast solar prediction' parameter on the parameters graph variable selector. Since Solcast only provides future data, you must have opened the app yesterday to view today’s prediction.
de: Deine Solcast-Vorhersagen werden abgerufen, wenn Energy Stats geladen wird (höchstens einmal alle 8 Stunden). Füge den Parameter „Solcast-Solarprognose“ im Variablenauswahlmenü des Parameterdiagramms hinzu. Da Solcast nur zukünftige Daten bereitstellt, musst du die App gestern geöffnet haben, um die heutige Vorhersage zu sehen.
es: Tus predicciones de Solcast se obtienen cuando Energy Stats se carga (como máximo una vez cada 8 horas). Agrega el parámetro “Predicción solar de Solcast” en el selector de variables del gráfico de parámetros. Como Solcast solo proporciona datos futuros, debes haber abierto la aplicación ayer para ver la predicción de hoy.
it: Le tue previsioni Solcast vengono recuperate quando Energy Stats si carica (al massimo una volta ogni 8 ore). Aggiungi il parametro “Previsione solare Solcast” nel selettore di variabili del grafico dei parametri. Poiché Solcast fornisce solo dati futuri, devi aver aperto l’app ieri per visualizzare la previsione di oggi.
pl: Twoje prognozy Solcast są pobierane podczas ładowania Energy Stats (maksymalnie raz na 8 godzin). Dodaj parametr „Prognoza słoneczna Solcast” w selektorze zmiennych wykresu parametrów. Ponieważ Solcast dostarcza tylko dane przyszłe, aby zobaczyć dzisiejszą prognozę, musiałeś otworzyć aplikację wczoraj.

source: Your Solcast predictions are fetched when you visit the Summary tab (at most once every 8 hours). Note that Solcast only provides future data.
de: Deine Solcast-Vorhersagen werden abgerufen, wenn du den Zusammenfassungs-Tab besuchst (höchstens einmal alle 8 Stunden). Bitte beachte, dass Solcast nur zukünftige Daten bereitstellt.
es: Tus predicciones de Solcast se obtienen cuando visitas la pestaña Resumen (como máximo una vez cada 8 horas). Ten en cuenta que Solcast solo proporciona datos futuros.
it: Le tue previsioni Solcast vengono recuperate quando visiti la scheda Riepilogo (al massimo una volta ogni 8 ore). Tieni presente che Solcast fornisce solo dati futuri.
pl: Twoje prognozy Solcast są pobierane, gdy odwiedzasz kartę Podsumowanie (maksymalnie raz na 8 godzin). Pamiętaj, że Solcast dostarcza tylko dane przyszłe.

source: Your system monitors the power being imported from the grid. If the import exceeds your Import Limit of %1$@ and your battery's state of charge (SOC) is above %2$@%%, the system discharges the battery to supply the excess demand, thereby “shaving” the peak load from the grid. This operation continues as long as the battery’s state of charge (SOC) is above a certain threshold SOC. Peak shaving only operates when you have the Peak Shaving mode enabled from the Inverter scheduler.
de: Ihr System überwacht den Strom, der aus dem Netz importiert wird. Wenn der Import Ihren Importgrenzwert von %1$@ überschreitet und der Ladezustand (SOC) Ihrer Batterie über %2$@%% liegt, entlädt das System die Batterie, um den zusätzlichen Bedarf zu decken und so die Spitzenlast vom Netz zu „kappen“. Dieser Vorgang wird fortgesetzt, solange der Ladezustand (SOC) der Batterie über einem bestimmten Schwellenwert liegt. Peak Shaving funktioniert nur, wenn der Modus „Peak Shaving“ im Wechselrichter-Zeitplan aktiviert ist.
es: Tu sistema monitorea la energía importada de la red. Si la importación supera tu Límite de Importación de %1$@ y el estado de carga (SOC) de la batería está por encima de %2$@%%, el sistema descarga la batería para suministrar la demanda adicional, reduciendo así el pico de carga desde la red. Esta operación continúa mientras el estado de carga (SOC) de la batería esté por encima de un umbral determinado. El Peak Shaving solo funciona cuando el modo Peak Shaving está activado desde el programador del inversor.
it: Il tuo sistema monitora l’energia importata dalla rete. Se l’importazione supera il tuo limite di importazione di %1$@ e lo stato di carica (SOC) della batteria è superiore a %2$@%%, il sistema scarica la batteria per soddisfare la domanda in eccesso, riducendo così il carico di picco dalla rete. Questa operazione continua finché lo stato di carica (SOC) della batteria rimane sopra una certa soglia. Il Peak Shaving funziona solo quando la modalità Peak Shaving è attivata dal pianificatore dell’inverter.
pl: Twój system monitoruje moc importowaną z sieci. Jeśli import przekracza Twój limit importu wynoszący %1$@, a poziom naładowania baterii (SOC) przekracza %2$@%%, system rozładowuje baterię, aby zaspokoić nadmiarowe zapotrzebowanie, tym samym „ścina” szczytowe obciążenie z sieci. Ta operacja trwa, dopóki poziom naładowania baterii (SOC) pozostaje powyżej określonego progu. Funkcja Peak Shaving działa tylko wtedy, gdy tryb Peak Shaving jest włączony w harmonogramie falownika.

source: Your template was activated
de: Deine Vorlage wurde aktiviert
es: Tu plantilla fue activada
it: Il tuo modello è stato attivato
pl: Twój szablon został aktywowany

source: Your template was saved
de: Deine Vorlage wurde gespeichert
es: Tu plantilla fue guardada
it: Il tuo modello è stato salvato
pl: Twój szablon został zapisany

source: Debug
es: Depurar
pl: Debugowanie

source: Enter a 4-digit passcode to **turn on** read-only mode.
es: Introduce un código de 4 dígitos para **activar** el modo de solo lectura.
it: Inserisci un passcode di 4 cifre per **attivare** la modalità di sola lettura.
pl: Wprowadź 4-cyfrowy kod dostępu, aby **włączyć** tryb tylko do odczytu.

source: FoxESS Cloud Status
es: Estado de FoxESS Cloud
it: Stato di FoxESS Cloud
pl: Status chmury FoxESS

source: hour
es: hora
it: ora
pl: Godzina

source: Import limit
es: Límite de importación
it: Limite di importazione
pl: Limit importu

source: Max SoC
es: SoC máx.
it: SoC massimo
pl: Maks. PoC

source: Mild
es: Suave
it: Mite
pl: Łagodny

source: Minimum and maximum temperature ranges are controlled by your inverter firmware.
es: Los rangos de temperatura mínima y máxima están controlados por el firmware de su inversor.
it: Gli intervalli di temperatura minimo e massimo sono controllati dal firmware del tuo inverter.
pl: Minimalne i maksymalne zakresy temperatur są kontrolowane przez oprogramowanie układowe falownika.

source: Name
es: Nombre
it: Nome
pl: Imię

source: OK
es: Aceptar

# settings.foxessCommunity
source: FoxESS Community Support Website
es: Sitio web de soporte de la comunidad FoxESS
it: Sito web di supporto della community FoxESS
pl: Strona wsparcia społeczności FoxESS

source: Start
es: Inicio
it: Inizio
pl: Początek

source: System
es: Sistema
it: Sistema
pl: Systemowy

source: Version
es: Versión
it: Versione
pl: Wersja

source: Auto
it: Automatico

# error_title
source: Error
it: Errore
pl: Błąd

source: Min SoC
it: SoC minimo
pl: Min. PoC
